package org.cs.basic.weixin.tools.weather;

/**
 * @author xuxile
 */
public class JSONCitys {
	private static final String jsonCity="{ \"china\": ["+  
		      
		        "{  \"province\": \"北京\", \"citys\": [ "+  
		            
		                "{ \"cityName\": \"北京\",  \"cityId\": \"101010100\" "+  
		                    
		                "},"+  
		                "{ \"cityName\": \"朝阳\",  \"cityId\": \"101010300\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"顺义\",  \"cityId\": \"101010400\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"怀柔\",  \"cityId\": \"101010500\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"通州\",  \"cityId\": \"101010600\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"昌平\",  \"cityId\": \"101010700\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"延庆\",  \"cityId\": \"101010800\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"丰台\",  \"cityId\": \"101010900\"  "+  
		                    
		                "},"+  
		                "{\"cityName\": \"石景山\",  \"cityId\": \"101011000\"  "+  
		                    
		                "},"+  
		                "{\"cityName\": \"大兴\",  \"cityId\": \"101011100\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"房山\",  \"cityId\": \"101011200\" "+  
		                     
		                "},"+  
		                "{ \"cityName\": \"密云\",  \"cityId\": \"101011300\""+  
		                     
		                "},"+  
		                "{ \"cityName\": \"门头沟\",  \"cityId\": \"101011400\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"平谷\",  \"cityId\": \"101011500\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"八达岭\", \"cityId\": \"101011600\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"佛爷顶\",  \"cityId\": \"101011700\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"汤河口\",  \"cityId\": \"101011800\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"密云上甸子\",  \"cityId\": \"101011900\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"斋堂\",  \"cityId\": \"101012000\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"霞云岭\",  \"cityId\": \"101012100\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"北京城区\",  \"cityId\": \"101012200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"海淀\",  \"cityId\": \"101010200\" "+  
		                     
		               "} "+  
		           "]"+   
		        "},"+ 
		           
		        "{ \"province\": \"天津citys\",  \"citys\": [ "+  
		            
		                "{\"cityName\": \"天津\",  \"cityId\": \"101030100\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宝坻\",  \"cityId\": \"101030300\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"东丽\",  \"cityId\": \"101030400\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"西青\",  \"cityId\": \"101030500\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"北辰\",  \"cityId\": \"101030600\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"蓟县\",  \"cityId\": \"101031400\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"汉沽\",  \"cityId\": \"101030800\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"静海\",  \"cityId\": \"101030900\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"津南\",  \"cityId\": \"101031000\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"塘沽\",  \"cityId\": \"101031100\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大港\",  \"cityId\": \"101031200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"武清\",  \"cityId\": \"101030200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宁河\",  \"cityId\": \"101030700\" "+  
		                     
		               "} "+  
		           " ]"+  
		        "},"+  
		        "{ \"province\": \"上海\",  \"citys\": ["+  
		             
		                "{\"cityName\": \"上海\",  \"cityId\": \"101020100\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宝山\",  \"cityId\": \"101020300\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"嘉定\",  \"cityId\": \"101020500\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"南汇\",  \"cityId\": \"101020600\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"浦东\",  \"cityId\": \"101021300\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"青浦\",  \"cityId\": \"101020800\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"松江\",  \"cityId\": \"101020900\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"奉贤\",  \"cityId\": \"101021000\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"崇明\",  \"cityId\": \"101021100\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"徐家汇\",  \"cityId\": \"101021200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"闵行\",  \"cityId\": \"101020200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"金山\",  \"cityId\": \"101020700\""+  
		                      
		               "}"+   
		            "]"+  
		        "},"+  
		        "{\"province\": \"河北\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"石家庄\",  \"cityId\": \"101090101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"张家口\",  \"cityId\": \"101090301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"承德\",  \"cityId\": \"101090402\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"唐山\",  \"cityId\": \"101090501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"秦皇岛\",  \"cityId\": \"101091101\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"沧州\",  \"cityId\": \"101090701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"衡水\",  \"cityId\": \"101090801\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"邢台\",  \"cityId\": \"101090901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"邯郸\",  \"cityId\": \"101091001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"保定\",  \"cityId\": \"101090201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"廊坊\",  \"cityId\": \"101090601\" "+  
		                     
		                "}"+  
		            "]"+  
		        "},"+  
		        "{ \"province\": \"河南\",  \"citys\": [ "+  
		            
		                "{\"cityName\": \"郑州\",  \"cityId\": \"101180101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"新乡\",  \"cityId\": \"101180301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"许昌\",  \"cityId\": \"101180401\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"平顶山\",  \"cityId\": \"101180501\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"信阳\",  \"cityId\": \"101180601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"南阳\",  \"cityId\": \"101180701\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"开封\",  \"cityId\": \"101180801\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"洛阳\",  \"cityId\": \"101180901\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"商丘\",  \"cityId\": \"101181001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"焦作\",  \"cityId\": \"101181101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鹤壁\",  \"cityId\": \"101181201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"濮阳\",  \"cityId\": \"101181301\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"周口\",  \"cityId\": \"101181401\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"漯河\",  \"cityId\": \"101181501\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"驻马店\",  \"cityId\": \"101181601\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"三门峡\",  \"cityId\": \"101181701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"济源\",  \"cityId\": \"101181801\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"安阳\",  \"cityId\": \"101180201\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"安徽\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"合肥\",  \"cityId\": \"101220101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"芜湖\",  \"cityId\": \"101220301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"淮南\",  \"cityId\": \"101220401\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"马鞍山\",  \"cityId\": \"101220501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"安庆\",  \"cityId\": \"101220601\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"宿州\",  \"cityId\": \"101220701\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"阜阳\",  \"cityId\": \"101220801\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"亳州\",  \"cityId\": \"101220901\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"黄山\",  \"cityId\": \"101221001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"滁州\",  \"cityId\": \"101221101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"淮北\",  \"cityId\": \"101221201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"铜陵\",  \"cityId\": \"101221301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宣城\",  \"cityId\": \"101221401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"六安\",  \"cityId\": \"101221501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"巢湖\",  \"cityId\": \"101221601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"池州\",  \"cityId\": \"101221701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"蚌埠\",  \"cityId\": \"101220201\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"浙江\",  \"citys\": [ "+  
		                "{\"cityName\": \"杭州\",  \"cityId\": \"101210101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"舟山\",  \"cityId\": \"101211101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"湖州\",  \"cityId\": \"101210201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"嘉兴\",  \"cityId\": \"101210301\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"金华\",  \"cityId\": \"101210901\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"绍兴\",  \"cityId\": \"101210501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"台州\",  \"cityId\": \"101210601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"温州\",  \"cityId\": \"101210701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"丽水\",  \"cityId\": \"101210801\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"衢州\",  \"cityId\": \"101211001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宁波\",  \"cityId\": \"101210401\" "+  
		                     
		               "}"+   
		            "]"+  
		        "},"+  
		        "{ \"province\": \"重庆\",  \"citys\": [ "+  
		            
		                "{\"cityName\": \"重庆\",  \"cityId\": \"101040100\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"合川\",  \"cityId\": \"101040300\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"南川\",  \"cityId\": \"101040400\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"江津\",  \"cityId\": \"101040500\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"万盛\",  \"cityId\": \"101040600\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"渝北\",  \"cityId\": \"101040700\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"北碚\",  \"cityId\": \"101040800\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"巴南\",  \"cityId\": \"101040900\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"长寿\",  \"cityId\": \"101041000\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"黔江\",  \"cityId\": \"101041100\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"万州天城\",  \"cityId\": \"101041200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"万州龙宝\",  \"cityId\": \"101041300\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"涪陵\",  \"cityId\": \"101041400\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"开县\",  \"cityId\": \"101041500\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"城口\",  \"cityId\": \"101041600\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"云阳\",  \"cityId\": \"101041700\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"巫溪\",  \"cityId\": \"101041800\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"奉节\",  \"cityId\": \"101041900\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"巫山\",  \"cityId\": \"101042000\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"潼南\",  \"cityId\": \"101042100\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"垫江\",  \"cityId\": \"101042200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"梁平\",  \"cityId\": \"101042300\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"忠县\",  \"cityId\": \"101042400\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"石柱\",  \"cityId\": \"101042500\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大足\",  \"cityId\": \"101042600\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"荣昌\",  \"cityId\": \"101042700\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"铜梁\",  \"cityId\": \"101042800\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"璧山\",  \"cityId\": \"101042900\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"丰都\",  \"cityId\": \"101043000\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"武隆\",  \"cityId\": \"101043100\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"彭水\",  \"cityId\": \"101043200\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"綦江\",  \"cityId\": \"101043300\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"酉阳\",  \"cityId\": \"101043400\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"秀山\",  \"cityId\": \"101043600\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"沙坪坝\",  \"cityId\": \"101043700\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"永川\",  \"cityId\": \"101040200\""+  
		                      
		                "} "+ 
		            "]"+  
		        "},"+  
		        "{\"province\": \"福建\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"福州\",  \"cityId\": \"101230101\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"泉州\",  \"cityId\": \"101230501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"漳州\",  \"cityId\": \"101230601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"龙岩\",  \"cityId\": \"101230701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"晋江\",  \"cityId\": \"101230509\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"南平\",  \"cityId\": \"101230901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"厦门\",  \"cityId\": \"101230201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宁德\",  \"cityId\": \"101230301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"莆田\",  \"cityId\": \"101230401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"三明\",  \"cityId\": \"101230801\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"甘肃\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"兰州\",  \"cityId\": \"101160101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"平凉\",  \"cityId\": \"101160301\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"庆阳\",  \"cityId\": \"101160401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"武威\",  \"cityId\": \"101160501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"金昌\",  \"cityId\": \"101160601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"嘉峪关\",  \"cityId\": \"101161401\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"酒泉\",  \"cityId\": \"101160801\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"天水\",  \"cityId\": \"101160901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"武都\",  \"cityId\": \"101161001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"临夏\",  \"cityId\": \"101161101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"合作\",  \"cityId\": \"101161201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"白银\",  \"cityId\": \"101161301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"定西\",  \"cityId\": \"101160201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"张掖\",  \"cityId\": \"101160701\" "+   
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"广东\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"广州\",  \"cityId\": \"101280101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"惠州\",  \"cityId\": \"101280301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"梅州\",  \"cityId\": \"101280401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"汕头\",  \"cityId\": \"101280501\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"深圳\",  \"cityId\": \"101280601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"珠海\",  \"cityId\": \"101280701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"佛山\",  \"cityId\": \"101280800\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"肇庆\",  \"cityId\": \"101280901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"湛江\",  \"cityId\": \"101281001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"江门\",  \"cityId\": \"101281101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"河源\",  \"cityId\": \"101281201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"清远\",  \"cityId\": \"101281301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"云浮\",  \"cityId\": \"101281401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"潮州\",  \"cityId\": \"101281501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"东莞\",  \"cityId\": \"101281601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"中山\",  \"cityId\": \"101281701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阳江\",  \"cityId\": \"101281801\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"揭阳\",  \"cityId\": \"101281901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"茂名\",  \"cityId\": \"101282001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"汕尾\",  \"cityId\": \"101282101\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"韶关\",  \"cityId\": \"101280201\" "+  
		                    
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"广西\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"南宁\",  \"cityId\": \"101300101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"柳州\",  \"cityId\": \"101300301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"来宾\",  \"cityId\": \"101300401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"桂林\",  \"cityId\": \"101300501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"梧州\",  \"cityId\": \"101300601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"防城港\",  \"cityId\": \"101301401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"贵港\",  \"cityId\": \"101300801\" "+  
		                     
		                "},"+  
		                "{ \"cityName\": \"玉林\",  \"cityId\": \"101300901\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"百色\",  \"cityId\": \"101301001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"钦州\",  \"cityId\": \"101301101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"河池\",  \"cityId\": \"101301201\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"北海\",  \"cityId\": \"101301301\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"崇左\",   \"cityId\": \"101300201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"贺州\",  \"cityId\": \"101300701\" "+  
		                     
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"贵州\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"贵阳\",  \"cityId\": \"101260101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"安顺\",  \"cityId\": \"101260301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"都匀\",  \"cityId\": \"101260401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"兴义\",  \"cityId\": \"101260906\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"铜仁\",  \"cityId\": \"101260601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"毕节\",  \"cityId\": \"101260701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"六盘水\",  \"cityId\": \"101260801\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"遵义\",  \"cityId\": \"101260201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"凯里\",  \"cityId\": \"101260501\""+  
		                      
		               "}"+   
		            "]"+  
		        "},"+  
		        "{\"province\": \"云南\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"昆明\",  \"cityId\": \"101290101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"红河\",  \"cityId\": \"101290301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"文山\",  \"cityId\": \"101290601\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"玉溪\",  \"cityId\": \"101290701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"楚雄\",  \"cityId\": \"101290801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"普洱\",  \"cityId\": \"101290901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"昭通\",  \"cityId\": \"101291001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"临沧\",  \"cityId\": \"101291101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"怒江\",  \"cityId\": \"101291201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"香格里拉\",  \"cityId\": \"101291301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"丽江\",  \"cityId\": \"101291401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"德宏\",  \"cityId\": \"101291501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"景洪\",  \"cityId\": \"101291601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大理\",  \"cityId\": \"101290201\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"曲靖\",  \"cityId\": \"101290401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"保山\",  \"cityId\": \"101290501\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"内蒙古\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"呼和浩特\",  \"cityId\": \"101080101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"乌海\",  \"cityId\": \"101080301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"集宁\",  \"cityId\": \"101080401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"通辽\",  \"cityId\": \"101080501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阿拉善左旗\",  \"cityId\": \"101081201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鄂尔多斯\",  \"cityId\": \"101080701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"临河\",  \"cityId\": \"101080801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"锡林浩特\",  \"cityId\": \"101080901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"呼伦贝尔\",  \"cityId\": \"101081000\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"乌兰浩特\",  \"cityId\": \"101081101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"包头\",  \"cityId\": \"101080201\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"赤峰\",  \"cityId\": \"101080601\" "+  
		                    
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"江西\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"南昌\",  \"cityId\": \"101240101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"上饶\",  \"cityId\": \"101240301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"抚州\",  \"cityId\": \"101240401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宜春\",  \"cityId\": \"101240501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鹰潭\",  \"cityId\": \"101241101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"赣州\",  \"cityId\": \"101240701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"景德镇\",  \"cityId\": \"101240801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"萍乡\",  \"cityId\": \"101240901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"新余\",  \"cityId\": \"101241001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"九江\",  \"cityId\": \"101240201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"吉安\",  \"cityId\": \"101240601\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"湖北\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"武汉\",  \"cityId\": \"101200101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"黄冈\",  \"cityId\": \"101200501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"荆州\",  \"cityId\": \"101200801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宜昌\",  \"cityId\": \"101200901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"恩施\",  \"cityId\": \"101201001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"十堰\",  \"cityId\": \"101201101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"神农架\",  \"cityId\": \"101201201\" "+  
		                     
		                "},"+  
		                "{ \"cityName\": \"随州\",  \"cityId\": \"101201301\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"荆门\",  \"cityId\": \"101201401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"天门\",  \"cityId\": \"101201501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"仙桃\",  \"cityId\": \"101201601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"潜江\",  \"cityId\": \"101201701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"襄樊\",  \"cityId\": \"101200201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鄂州\",  \"cityId\": \"101200301\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"孝感\",  \"cityId\": \"101200401\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"黄石\",  \"cityId\": \"101200601\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"咸宁\",  \"cityId\": \"101200701\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"四川\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"成都\",  \"cityId\": \"101270101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"自贡\",  \"cityId\": \"101270301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"绵阳\",  \"cityId\": \"101270401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"南充\",  \"cityId\": \"101270501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"达州\",  \"cityId\": \"101270601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"遂宁\",  \"cityId\": \"101270701\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"广安\",  \"cityId\": \"101270801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"巴中\",  \"cityId\": \"101270901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"泸州\",  \"cityId\": \"101271001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宜宾\",  \"cityId\": \"101271101\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"内江\",  \"cityId\": \"101271201\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"资阳\",  \"cityId\": \"101271301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"乐山\",  \"cityId\": \"101271401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"眉山\",  \"cityId\": \"101271501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"凉山\",  \"cityId\": \"101271601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"雅安\",  \"cityId\": \"101271701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"甘孜\",  \"cityId\": \"101271801\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"阿坝\",  \"cityId\": \"101271901\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"德阳\",  \"cityId\": \"101272001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"广元\",  \"cityId\": \"101272101\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"攀枝花\",  \"cityId\": \"101270201\" "+  
		                    
		               " }"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"宁夏\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"银川\",  \"cityId\": \"101170101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"中卫\",\"cityId\": \"101170501\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"固原\",\"cityId\": \"101170401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"石嘴山\", \"cityId\": \"101170201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"吴忠\", \"cityId\": \"101170301\" "+  
		                     
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"青海province\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"西宁\",  \"cityId\": \"101150101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"黄南\", \"cityId\": \"101150301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"海北\",\"cityId\": \"101150801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"果洛\",\"cityId\": \"101150501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"玉树\",\"cityId\": \"101150601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"海西\",\"cityId\": \"101150701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"海东\", \"cityId\": \"101150201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"海南\", \"cityId\": \"101150401\""+  
		                      
		               "}"+   
		            "]"+  
		        "},"+  
		        "{\"province\": \"山东\",  \"citys\": [  "+  
		            
		                "{\"cityName\": \"济南\",  \"cityId\": \"101120101\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"潍坊\",  \"cityId\": \"101120601\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"临沂\",  \"cityId\": \"101120901\" "+  
		                    
		                "},"+  
		                "{\"cityName\": \"菏泽\",  \"cityId\": \"101121001\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"滨州\",  \"cityId\": \"101121101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"东营\",  \"cityId\": \"101121201\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"威海\",  \"cityId\": \"101121301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"枣庄\",  \"cityId\": \"101121401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"日照\",  \"cityId\": \"101121501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"莱芜\",  \"cityId\": \"101121601\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"聊城\",  \"cityId\": \"101121701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"青岛\",  \"cityId\": \"101120201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"淄博\",  \"cityId\": \"101120301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"德州\",  \"cityId\": \"101120401\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"烟台\",  \"cityId\": \"101120501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"济宁\",  \"cityId\": \"101120701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"泰安\",  \"cityId\": \"101120801\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"陕西province\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"西安\",  \"cityId\": \"101110101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"延安\",  \"cityId\": \"101110300\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"榆林\",  \"cityId\": \"101110401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"铜川\",  \"cityId\": \"101111001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"商洛\",  \"cityId\": \"101110601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"安康\",  \"cityId\": \"101110701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"汉中\",  \"cityId\": \"101110801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"宝鸡\",  \"cityId\": \"101110901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"咸阳\",  \"cityId\": \"101110200\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"渭南\",  \"cityId\": \"101110501\" "+  
		                     
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"山西\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"太原\",  \"cityId\": \"101100101\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"临汾\",  \"cityId\": \"101100701\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"运城\",  \"cityId\": \"101100801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"朔州\",  \"cityId\": \"101100901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"忻州\",  \"cityId\": \"101101001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"长治\",  \"cityId\": \"101100501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大同\",  \"cityId\": \"101100201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阳泉\",  \"cityId\": \"101100301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"晋中\",  \"cityId\": \"101100401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"晋城\",  \"cityId\": \"101100601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"吕梁\",  \"cityId\": \"101101100\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"新疆\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"乌鲁木齐\",  \"cityId\": \"101130101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"石河子\",  \"cityId\": \"101130301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"昌吉\",  \"cityId\": \"101130401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"吐鲁番\",  \"cityId\": \"101130501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"库尔勒\",  \"cityId\": \"101130601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阿拉尔\",  \"cityId\": \"101130701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阿克苏\",  \"cityId\": \"101130801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"喀什\",  \"cityId\": \"101130901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"伊宁\",  \"cityId\": \"101131001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"塔城\",  \"cityId\": \"101131101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"哈密\",  \"cityId\": \"101131201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"和田\",  \"cityId\": \"101131301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阿勒泰\",  \"cityId\": \"101131401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阿图什\",  \"cityId\": \"101131501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"博乐\",  \"cityId\": \"101131601\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"克拉玛依\",  \"cityId\": \"101130201\""+  
		                     
		                "}"+  
		            "]"+  
		        "},"+  
		        "{ \"province\": \"西藏\",  \"citys\": ["+  
		             
		                "{\"cityName\": \"拉萨\",  \"cityId\": \"101140101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"山南\",  \"cityId\": \"101140301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阿里\",  \"cityId\": \"101140701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"昌都\",  \"cityId\": \"101140501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"那曲\",  \"cityId\": \"101140601\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"日喀则\",  \"cityId\": \"101140201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"林芝\",  \"cityId\": \"101140401\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"台湾\",  \"citys\": ["+  
		              
		                "{ \"cityName\": \"台北县\",  \"cityId\": \"101340101\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"高雄\",  \"cityId\": \"101340201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"台中\",  \"cityId\": \"101340401\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"海南province\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"海口\",  \"cityId\": \"101310101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"三亚\",  \"cityId\": \"101310201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"东方\",  \"cityId\": \"101310202\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"临高\",  \"cityId\": \"101310203\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"澄迈\",  \"cityId\": \"101310204\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"儋州\",  \"cityId\": \"101310205\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"昌江\",  \"cityId\": \"101310206\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"白沙\",  \"cityId\": \"101310207\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"琼中\",  \"cityId\": \"101310208\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"定安\",  \"cityId\": \"101310209\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"屯昌\",  \"cityId\": \"101310210\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"琼海\",  \"cityId\": \"101310211\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"文昌\",  \"cityId\": \"101310212\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"保亭\",  \"cityId\": \"101310214\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"万宁\",  \"cityId\": \"101310215\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"陵水\",  \"cityId\": \"101310216\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"西沙\",  \"cityId\": \"101310217\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"南沙岛\",  \"cityId\": \"101310220\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"乐东\",  \"cityId\": \"101310221\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"五指山\",  \"cityId\": \"101310222\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"琼山\",  \"cityId\": \"101310102\" "+  
		                     
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"湖南\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"长沙\",  \"cityId\": \"101250101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"株洲\",  \"cityId\": \"101250301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"衡阳\",  \"cityId\": \"101250401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"郴州\",  \"cityId\": \"101250501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"常德\",  \"cityId\": \"101250601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"益阳\",  \"cityId\": \"101250700\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"娄底\",  \"cityId\": \"101250801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"邵阳\",  \"cityId\": \"101250901\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"岳阳\",  \"cityId\": \"101251001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"张家界\",  \"cityId\": \"101251101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"怀化\",  \"cityId\": \"101251201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"黔阳\",  \"cityId\": \"101251301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"永州\",  \"cityId\": \"101251401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"吉首\",  \"cityId\": \"101251501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"湘潭\",  \"cityId\": \"101250201\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"江苏\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"南京\",  \"cityId\": \"101190101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"镇江\",  \"cityId\": \"101190301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"苏州\",  \"cityId\": \"101190401\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"南通\",  \"cityId\": \"101190501\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"扬州\",  \"cityId\": \"101190601\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"宿迁\",  \"cityId\": \"101191301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"徐州\",  \"cityId\": \"101190801\" "+  
		                     
		                "},"+  
		                "{\"cityName\": \"淮安\",  \"cityId\": \"101190901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"连云港\",  \"cityId\": \"101191001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"常州\",  \"cityId\": \"101191101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"泰州\",  \"cityId\": \"101191201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"无锡\",  \"cityId\": \"101190201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"盐城\",  \"cityId\": \"101190701\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"黑龙江\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"哈尔滨\",  \"cityId\": \"101050101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"牡丹江\",  \"cityId\": \"101050301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"佳木斯\",  \"cityId\": \"101050401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"绥化\",  \"cityId\": \"101050501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"黑河\",  \"cityId\": \"101050601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"双鸭山\",  \"cityId\": \"101051301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"伊春\",  \"cityId\": \"101050801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大庆\",  \"cityId\": \"101050901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"七台河\",  \"cityId\": \"101051002\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鸡西\",  \"cityId\": \"101051101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鹤岗\",  \"cityId\": \"101051201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"齐齐哈尔\",  \"cityId\": \"101050201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大兴安岭\",  \"cityId\": \"101050701\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"吉林\",  \"citys\": [ "+  
		             
		                "{\"cityName\": \"长春\",  \"cityId\": \"101060101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"延吉\",  \"cityId\": \"101060301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"四平\",  \"cityId\": \"101060401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"白山\",  \"cityId\": \"101060901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"白城\",  \"cityId\": \"101060601\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"辽源\",  \"cityId\": \"101060701\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"松原\",  \"cityId\": \"101060801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"吉林\",  \"cityId\": \"101060201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"通化\",  \"cityId\": \"101060501\""+  
		                      
		                "}"+  
		            "]"+  
		        "},"+  
		        "{\"province\": \"辽宁\",  \"citys\": ["+  
		              
		                "{\"cityName\": \"沈阳\",  \"cityId\": \"101070101\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"鞍山\",   \"cityId\": \"101070301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"抚顺\",  \"cityId\": \"101070401\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"本溪\",   \"cityId\": \"101070501\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"丹东\",  \"cityId\": \"101070601\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"葫芦岛\",  \"cityId\": \"101071401\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"营口\",  \"cityId\": \"101070801\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"阜新\",  \"cityId\": \"101070901\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"辽阳\",  \"cityId\": \"101071001\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"铁岭\",  \"cityId\": \"101071101\""+  
		                      
		                "},"+  
		                "{ \"cityName\": \"朝阳\",  \"cityId\": \"101071201\""+  
		                     
		                "},"+  
		                "{\"cityName\": \"盘锦\",  \"cityId\": \"101071301\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"大连\",  \"cityId\": \"101070201\""+  
		                      
		                "},"+  
		                "{\"cityName\": \"锦州\",  \"cityId\": \"101070701\""+  
		                      
		                "}"+  
		            "]"+  
		        "}"+  
		    "]"+  
		"}" ;
		public String getCitys(){
			
			return jsonCity;
		}
	}
